OFoamDjango/OFCases/pitzDaily_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Note: this file is a Copy of $FOAM_TUTORIALS/resources/blockMesh/pitzDaily

convertToMeters 0.001;
dx1 REPLACEME_DX1; 
ndx1 -REPLACEME_DX1;
dx2 REPLACEME_DX2; 
ndx2 -REPLACEME_DX2;
dx3 REPLACEME_DX3; 
ndx3 -REPLACEME_DX3;
dy1 REPLACEME_DY1; 
ndy1 -REPLACEME_DY1;
dy2 REPLACEME_DY2; 
ndy2 -REPLACEME_DY2;

dx4 #calc "$dx2 + $dx3";


vertices
(
    ($ndx1 0 -0.5)
    ($ndx1 $dy1 -0.5)
    (0 $ndy1 -0.5)
    (0 0 -0.5)
    (0 $dy1 -0.5)
    ($dx2 $ndy1 -0.5)
    ($dx2 0 -0.5)
    ($dx2 $dy1 -0.5)
    ($dx4 $ndy2 -0.5)
    ($dx4 0 -0.5)
    ($dx4 $dy2 -0.5)

    ($ndx1 0 0.5)
    ($ndx1 $dy1 0.5)
    (0 $ndy1 0.5)
    (0 0 0.5)
    (0 $dy1 0.5)
    ($dx2 $ndy1 0.5)
    ($dx2 0 0.5)
    ($dx2 $dy1 0.5)
    ($dx4 $ndy2 0.5)
    ($dx4 0 0.5)
    ($dx4 $dy2 0.5)
);

negY
(
    (2 4 1)
    (1 3 0.3)
);

posY
(
    (1 4 2)
    (2 3 4)
    (2 4 0.25)
);

posYR
(
    (2 1 1)
    (1 1 0.25)
);


blocks
(
    hex (0 3 4 1 11 14 15 12)
    (18 30 1)
    simpleGrading (0.5 $posY 1)

    hex (2 5 6 3 13 16 17 14)
    (180 27 1)
    edgeGrading (4 4 4 4 $negY 1 1 $negY 1 1 1 1)

    hex (3 6 7 4 14 17 18 15)
    (180 30 1)
    edgeGrading (4 4 4 4 $posY $posYR $posYR $posY 1 1 1 1)

    hex (5 8 9 6 16 19 20 17)
    (25 27 1)
    simpleGrading (2.5 1 1)

    hex (6 9 10 7 17 20 21 18)
    (25 30 1)
    simpleGrading (2.5 $posYR 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 12 11)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 20 19)
            (9 10 21 20)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (1 4 15 12)
            (4 7 18 15)
            (7 10 21 18)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 14 11)
            (3 2 13 14)
            (2 5 16 13)
            (5 8 19 16)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 4 1)
            (2 5 6 3)
            (3 6 7 4)
            (5 8 9 6)
            (6 9 10 7)
            (11 14 15 12)
            (13 16 17 14)
            (14 17 18 15)
            (16 19 20 17)
            (17 20 21 18)
        );
    }
);

// ************************************************************************* //
